{"id":6521,"date":"2022-11-28T11:51:29","date_gmt":"2022-11-28T11:51:29","guid":{"rendered":"https:\/\/www.masteresearch.com\/?p=6521"},"modified":"2022-11-28T11:52:23","modified_gmt":"2022-11-28T11:52:23","slug":"slower-growth-will-be-good-for-india-for-now-economists-say","status":"publish","type":"post","link":"https:\/\/www.masteresearch.com\/2022\/11\/28\/slower-growth-will-be-good-for-india-for-now-economists-say\/","title":{"rendered":"Slower growth will be good for India, for now, economists say"},"content":{"rendered":"<div class=\"bt_bb_wrapper\"><p>India’s annual economic growth is forecast to slow to about 6% for a few years, according to economists including from Goldman Sachs Group Inc. and Barclays Plc.. And they say that’s not such a bad thing.<\/p>\n<p>Gross domestic product expansion at about 6% is a sweet spot for Asia’s third-largest economy to steer inflation back to the Reserve Bank of India’s target, and also to narrow budget and current account deficits, said Rahul Bajoria of Barclays. Price gains have stayed above RBI’s 2%-6% ..<br \/>\nFor Santanu Sengupta of Goldman Sachs, a growth slowdown will be good for India, expecting GDP expansion to ease to 6% next fiscal year from about 7.1% in the year ending March. “That would make the twin deficits problems more manageable,” he said last week, referring to budget and current account gaps.<br \/>\nThe South Asian nation may lose its world-beating growth distinction as demand may be impacted by borrowing costs that have returned to pre-pandemic levels after 190 basis points of key rate increases since May to tame inflation. GDP probably rose 6.2% in the three months to September from a year ago, slowing from 13.51% in April-June, according to a Bloomberg survey of economists before Wednesday’s data.<br \/>\nA slower growth in India would also be consistent with a much deeper global slowdown, said Saugata Bhattacharya, chief economist of Axis Bank Ltd. “The reduced demand will help control the current account deficit and enable a steeper glide path of inflation.”<\/p>\n<p>Economists in a Bloomberg survey forecast India to expand at 7% this fiscal year ending March, before slowing to 6.1% the year after. Inflation is also forecast to ease to 5.1% in the financial year to March 2024 from 6.7% in the c ..<br \/>\nThe key issue is that India’s widening growth differentials relative to rest of the world is double edged, as it brings risks of a larger external deficit with it,” said Barclays’s Bajoria.<br \/>\nThe Indian economy is in a better shape than most other large economies, but its momentum will be affected by the global slowdown, said Niranjan Rajadhyaksha, chief executive officer of Artha India, an economic research firm. “Given the current levels of inflation, trade deficit and fiscal deficit, it would be better to consolidate for now rather than push for extra growth by stimulating domestic demand.”<\/p>\n<p>Source : <a href=\"https:\/\/tinyurl.com\/muhcsbhr\" target=\"_blank\" rel=\"noopener\"><strong>https:\/\/tinyurl.com\/muhcsbhr<\/strong><\/a><\/p>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>India’s annual economic growth is forecast to slow to about 6% for a few years, according to economists including from Goldman Sachs Group Inc. and Barclays Plc.. And they say that’s not such a bad thing. Gross domestic product expansion at about 6% is a sweet spot for Asia’s third-largest economy to steer inflation back&#8230;<\/p>\n","protected":false},"author":1,"featured_media":6522,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false,"_themeisle_gutenberg_block_has_review":false},"categories":[3],"tags":[],"wppr_data":{"cwp_meta_box_check":"No"},"_links":{"self":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/posts\/6521"}],"collection":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/comments?post=6521"}],"version-history":[{"count":1,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/posts\/6521\/revisions"}],"predecessor-version":[{"id":6523,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/posts\/6521\/revisions\/6523"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/media\/6522"}],"wp:attachment":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/media?parent=6521"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/categories?post=6521"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/tags?post=6521"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}