{"id":6546,"date":"2022-12-06T10:55:27","date_gmt":"2022-12-06T10:55:27","guid":{"rendered":"https:\/\/www.masteresearch.com\/?p=6546"},"modified":"2022-12-06T10:55:39","modified_gmt":"2022-12-06T10:55:39","slug":"rbi-meet-how-indias-key-economic-indicators-shaped-up-before-policy-decision-tomorrow","status":"publish","type":"post","link":"https:\/\/www.masteresearch.com\/2022\/12\/06\/rbi-meet-how-indias-key-economic-indicators-shaped-up-before-policy-decision-tomorrow\/","title":{"rendered":"RBI Meet: How India&#8217;s key economic indicators shaped up before policy decision tomorrow"},"content":{"rendered":"<div class=\"bt_bb_wrapper\"><p>The Reserve Bank of India-led rate setting panel is widely expected to raise the benchmark rate for a fifth straight time at the end of its policy review tomorrow.<\/p>\n<p>However, it is unlikely to go overboard as it needs to fuel growth amid forecasts of deteriorating global outlook and chances of price pressures easing from multi-year highs. Key global central banks, including the Federal Reserve, are also likely to take the foot off the pedal.<\/p>\n<p>The Monetary Policy Committee is exp ..<br \/>\nHDFC Bank&#8217;s Principal Economist Sakshi Gupta said the central bank is unlikely to go for a 50 bps hike as that will be too aggressive given that inflation has started showing signs of moderation and is progressing in line with the RBI&#8217;s projections.<\/p>\n<p>&#8220;Central banks across the world are facing the challenge of walking the tightrope between growth and inflation,&#8221; Gupta said.<\/p>\n<p>To recap, RBI Governor and MPC Chair Shakitkanta Das in the last policy had said, while advanced economies ..<br \/>\nShaktikanta Das has ruled out a recession for India, while key government officials including the finance minister have said India remains a bright spot amid the global headwinds.<\/p>\n<p>However, from foreign brokerages to rating agencies, most of them have in recent days slashed India’s economic growth forecasts. The expected slowdowns in Europe and North America, along with China&#8217;s sluggish economy are likely to hurt growth, while Russia’s attack on Ukraine lingers. Geopolitical uncertainty, ..<br \/>\nOne of the key drivers for the policy decision will be the inflation readings and their trajectory.<\/p>\n<p>Indicating easing of the price situation, retail inflation moderated to a three-month low of 6.7% in October, while the wholesale price index fell to a 19-month low mainly on account of subdued rates of food items. Food inflation for October came in at 7.01 per cent as against 8.6 per cent a month before.<\/p>\n<p>However, the inflation print remained above the central bank’s mandate to k ..<br \/>\nAhead of the policy review in September, India’s foreign exchange reserves had dropped to $545.65 billion, which was then the lowest level since Oct 2, 2020. The reserves fell further to an over two-year low of $524.52 billion for the week ending Oct 21, depleting by $117.93 billion from the record high of $642.45 billion seen on September 3 last year.<\/p>\n<p>However, it has now risen for three straight weeks stood at $550.14 billion for the week ending Nov 25.For the week ending Nov 18, the f ..<br \/>\nIndia’s trade deficit narrowed to $26.91 billion in October from $27.98 billion in August. The merchandise trade deficit for April-October 2022 was estimated at $173.46 billion as against $125.22 billion between April-August 2022.<\/p>\n<p>Exports dropped to $29.78 billion in October, which was the first decline below $30 billion for the first time in nearly 20 months. India’s exports contracted 16.7% on an annual basis from a growth of 4.8% seen in September, pointing to a decline in global dem ..<br \/>\nBriefing media, Commerce Secretary Sunil Barthwal said that global headwinds are impacting consumption worldwide and that would have an impact on India&#8217;s exports as well.<\/p>\n<p>&#8220;The pinch from slowing external demand is going to get more painful for the Indian economy in the months to come. We could see a significant portion of India’s GDP shaved by widening of trade deficit in the subsequent quarters,&#8221; CARE’s Sinha said.<\/p>\n<p>Meanwhile, India&#8217;s quarterly current account deficit had surge ..<br \/>\nWhile announcing the policy in September, Shaktikanta Das had said that the world is in the eye of a new storm or the third major shock, which he said was arising from aggressive monetary policy actions and even more aggressive communication from advanced economy central banks like the US Fed.<\/p>\n<p>The Federal Reserve raised the target range for the federal funds rate by 75 bps to 3.75%-4% during its policy review last month, after starting the year with a near zero rate. This was the sixth ..<br \/>\nThe price of the Indian basket of crude oil was around $88.6 a barrel in November, government data showed. This is sharply lower from a decadal high of $121.28 per barrel on June 10. The average as of September 22 was 90.75\/bbl.<\/p>\n<p>Brent crude futures were at $83 a barrel and West Texas Intermediate (WTI) crude futures stood at $77.32. They were down from $87.69 a barrel and $81.73, respectively, before the September policy review.<\/p>\n<p>It will be interesting to see if the RBI revises ..<br \/>\nWhile the RBI has looked to check the run-away inflation, it will also look to keep the economy humming. Demand for loans is a key parameter to gauge economic activities.<\/p>\n<p>According to RBI data, bank credit rose by 16.96% to Rs 133.29 lakh crore as of the fortnight ended November 18. Before the last policy meeting, bank credit rose by 16.2% to Rs 125.5 lakh crore in the fortnight ended September 9.<\/p>\n<p>Growth in bank credit has accelerated during the financial year which is a positi ..<\/p>\n<p>Source : <a href=\"https:\/\/tinyurl.com\/bdctzsme\" target=\"_blank\" rel=\"noopener\"><strong>https:\/\/tinyurl.com\/bdctzsme<\/strong><\/a><\/p>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>The Reserve Bank of India-led rate setting panel is widely expected to raise the benchmark rate for a fifth straight time at the end of its policy review tomorrow. However, it is unlikely to go overboard as it needs to fuel growth amid forecasts of deteriorating global outlook and chances of price pressures easing from&#8230;<\/p>\n","protected":false},"author":1,"featured_media":6547,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false,"_themeisle_gutenberg_block_has_review":false},"categories":[3],"tags":[],"wppr_data":{"cwp_meta_box_check":"No"},"_links":{"self":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/posts\/6546"}],"collection":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/comments?post=6546"}],"version-history":[{"count":1,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/posts\/6546\/revisions"}],"predecessor-version":[{"id":6548,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/posts\/6546\/revisions\/6548"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/media\/6547"}],"wp:attachment":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/media?parent=6546"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/categories?post=6546"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/tags?post=6546"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}