{"id":7087,"date":"2023-04-06T10:36:00","date_gmt":"2023-04-06T10:36:00","guid":{"rendered":"https:\/\/www.masteresearch.com\/?p=7087"},"modified":"2023-04-06T10:37:49","modified_gmt":"2023-04-06T10:37:49","slug":"instant-view-what-experts-think-of-rbis-surprise-rate-decision","status":"publish","type":"post","link":"https:\/\/www.masteresearch.com\/2023\/04\/06\/instant-view-what-experts-think-of-rbis-surprise-rate-decision\/","title":{"rendered":"Instant View: What experts think of RBI&#8217;s surprise rate decision"},"content":{"rendered":"<div class=\"bt_bb_wrapper\"><p>The Reserve Bank of India (RBI) surprised markets by holding its key repo rate steady on Thursday after six consecutive hikes, saying it was closely monitoring the impact of recent global financial turbulence.<\/p>\n<p>The central bank said its policy stance remains focused on &#8220;withdrawal of accommodation&#8221;, signalling it could consider further rate hikes if necessary. The pause in rate hikes is &#8220;for this meeting only&#8221;, said RBI Governor Shaktikanta Das.<\/p>\n<p>The monetary policy committee (MPC) ..<br \/>\nMost analysts had expected one final 25 basis point hike in the RBI&#8217;s current tightening cycle, which has seen it raise the repo rate by a total 250 bps since May last year.<br \/>\nIn a surprising move, the RBI indicated a pause in the monetary policy keeping the repo rate unchanged at 6.5% with &#8220;readiness to act should the situation so warrant&#8221; with a unanimous vote maintaining stance of &#8220;Withdrawal of Accommodation&#8221;. Again the governor emphasised that the pause is in this meeting only.<\/p>\n<p>While there may be many reasons to pause, the fact that the RBI has noted their &#8220;readiness to act should the situation warrant&#8221; and &#8220;job is not yet finished&#8221; suggests that the paus ..<br \/>\nThe RBI&#8217;s decision to keep the repo rate on hold today comes as a surprise and belies the central bank&#8217;s recent hawkish communications. The door remains ajar for hikes in the future but with headline inflation set to fall back to within the RBI&#8217;s 2-6% target range before long, we think the tightening cycle has now come to an end.<\/p>\n<p>Today&#8217;s meeting doesn&#8217;t serve as forward guidance and the hiking cycle could resume if the data warrants it. But given the subdued growth outlook and the likeli ..<br \/>\nAs the central bank expects inflation to moderate going ahead, we believe this is the last rate hike in the cycle, and expect the RBI to stay on hold through the rest of FY2023-24. Governor Das flagged unprecedented uncertainty in geopolitics, financial markets and the economic landscape, and continued to sound caution around the inflation outlook, especially core inflation.<\/p>\n<p>We no longer expect any further rate hikes from the MPC in FY23-24. We think only a material upside surprise keepi ..<br \/>\nWith the likely softening of CPI to the low- to mid-5% levels in the coming month, the current repo rate of 6.5% implies that India&#8217;s real policy rate will hover around 1% during 2023-24, while maintaining a policy rate differential of about 1.5% with the US. This clearly helped the decision of a pause on the repo rate.<\/p>\n<p>In the current EBLR regime of immediate and fuller pass through of repo rate hikes to lending rates, it is heartening to see a more balanced and nuanced approach from the ..<br \/>\nWe see today&#8217;s action as a breather in this rate hike cycle with financial stability taking precedence amid global bank failures and associated tight financial conditions. With stance remaining unchanged, MPC has now become data dependent.<\/p>\n<p>We believe the bar for future rate hikes has increased, especially since near-term prints of CPI will be sub 6%. We expect FY24 CPI to range between 5.2-5.5% in FY24E and GDP growth at 5.7%-5.8% in FY24E.<\/p>\n<p>Key risk to watch out for would be food ..<br \/>\nThe decision to pause at 6.5% was a positive surprise. We believe the RBI is concerned about the uncertainty in global financial markets and the pause is reflective of this concern. We view this policy as a hawkish pause. The tone of the policy remains concerned about inflation, especially core inflation and remains focused on reaching the 4% target over the medium term.<\/p>\n<p>The RBI remains comfortably on the growth front, for now. We believe the risks to this outlook is skewed towards the d ..<br \/>\nWith inflation still elevated and most major central banks hiking rates recently, the chance of a 25 bps rate hike was considerable. The RBI opting for a pause seems to suggest that the central bank expects softer inflation and growth. With this, it seems that the RBI has come to the end of rate hike for this cycle. Unless there was a big surprise either on inflation or growth, we expect the RBI to remain in pause mode during 2023.<br \/>\nFollowing in the footsteps of some recent global policy announcements (like the RBA), the RBI unanimously delivered a hawkish pause. Growth was revised up to 6.5% while inflation estimates were revised down.<\/p>\n<p>However, the governor highlighted that they will not refrain from taking further action if required, especially in light of the recent increase in oil prices and given core inflation remains elevated.<\/p>\n<p>We could see the RBI now going on an extended pause throughout FY24 while l ..<br \/>\nThe RBI MPC surprised with a pause on Thursday but emphasised that the path ahead will be nimble to address evolving inflationary risks and maintained its hawkish stance. Tone on growth was upbeat, validated by a small upward revision to the FY24 growth target.<\/p>\n<p>Oil projection was cut, besides factoring in the assumption of a normal monsoon. With policymakers highlighting risks to global financial stability, the tightening cycle has likely slipped into an extended pause, barring unexpecte ..<\/p>\n<p>Source :<a href=\"https:\/\/tinyurl.com\/4nx7t9az\" target=\"_blank\" rel=\"noopener\"><strong> https:\/\/tinyurl.com\/4nx7t9az<\/strong><\/a><\/p>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>The Reserve Bank of India (RBI) surprised markets by holding its key repo rate steady on Thursday after six consecutive hikes, saying it was closely monitoring the impact of recent global financial turbulence. The central bank said its policy stance remains focused on &#8220;withdrawal of accommodation&#8221;, signalling it could consider further rate hikes if necessary&#8230;.<\/p>\n","protected":false},"author":1,"featured_media":7094,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false,"_themeisle_gutenberg_block_has_review":false},"categories":[3],"tags":[],"wppr_data":{"cwp_meta_box_check":"No"},"_links":{"self":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/posts\/7087"}],"collection":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/comments?post=7087"}],"version-history":[{"count":1,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/posts\/7087\/revisions"}],"predecessor-version":[{"id":7095,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/posts\/7087\/revisions\/7095"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/media\/7094"}],"wp:attachment":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/media?parent=7087"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/categories?post=7087"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/tags?post=7087"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}