{"id":7130,"date":"2023-04-17T09:19:29","date_gmt":"2023-04-17T09:19:29","guid":{"rendered":"https:\/\/www.masteresearch.com\/?p=7130"},"modified":"2023-04-17T09:19:43","modified_gmt":"2023-04-17T09:19:43","slug":"finance-minister-sitharaman-gets-talking-on-adani-russian-oil-buys-jobs-and-crypto","status":"publish","type":"post","link":"https:\/\/www.masteresearch.com\/2023\/04\/17\/finance-minister-sitharaman-gets-talking-on-adani-russian-oil-buys-jobs-and-crypto\/","title":{"rendered":"Finance Minister Sitharaman gets talking on Adani, Russian oil buys, jobs and crypto"},"content":{"rendered":"<div class=\"bt_bb_wrapper\"><p>India’s Finance Minister Nirmala Sitharaman said the South Asian nation could buy Russian crude oil near or past the price cap imposed by the G-7 if the recent OPEC+ output cut increases energy costs.<\/p>\n<p>“We will have to constantly re-figure where we get the best deal as it is a critical input for the economy,” Sitharaman said in a wideranging interview, adding that the nation will look at “affordable prices” to serve its large population.<\/p>\n<p>From the sidelines of the International Mon ..<br \/>\nWe are making enough efforts to make sure the economy remains buoyant,” Sitharaman said. External factors, including the OPEC+ output cut and “the spillover of all the decisions” related to Russia’s war in Ukraine are “the two main things which I think I’d be more worried about than anything internal.”<\/p>\n<p>She also said weakness in demand for manufacturing goods and services activity could be a drag on India’s recovery going forward.<br \/>\nThe Reserve Bank of India has found reasonable justification to pause for now, Sitharaman said. “They are keeping a very close eye on the economy and business leaders have welcomed this pause with a sense of relief.”<\/p>\n<p>The central bank has given a hawkish outlook for India’s inflation, but the price-gain trajectory will depend of monsoon rainfall going ahead, she said.<br \/>\nWe hope to continue on the glide path,” she said, adding that the government will adhere to the budgeted target of 5.9% for the fiscal year starting April. “We have been careful.”<br \/>\nIn India, privatization goes through a whole lot of filters as all stakeholders have to be kept together, Sitharaman said when asked about the slow progress of stake sales in state-run firms. “The idea is not to close units down, it’s more that the government wants to get out of businesses where more equity is not possible but there’s interest outside and the economy will benefit if the companies are kept as going concern, so those considerations do take time.”<\/p>\n<p>Government of India stays at a distance from companies,” the minister said, adding that a Supreme Court-monitored panel will probe allegations made by the US short-seller Hindenburg Research against the Adani Group. “We think it may be inappropriate to comment even as the judiciary is having a look at it.”<br \/>\nMore reports show that cryptocurrencies have macro-stability implications, Sitharaman said. If there’s a consensus among G-20 members, “we will look at a broad framework and will leave it to each country to adopt their own legislative framework,” she said.<\/p>\n<p>Source : <a href=\"https:\/\/tinyurl.com\/5xdb7h59\" target=\"_blank\" rel=\"noopener\"><strong>https:\/\/tinyurl.com\/5xdb7h59<\/strong><\/a><\/p>\n<\/div>","protected":false},"excerpt":{"rendered":"<p>India’s Finance Minister Nirmala Sitharaman said the South Asian nation could buy Russian crude oil near or past the price cap imposed by the G-7 if the recent OPEC+ output cut increases energy costs. “We will have to constantly re-figure where we get the best deal as it is a critical input for the economy,”&#8230;<\/p>\n","protected":false},"author":1,"featured_media":7131,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false,"_themeisle_gutenberg_block_has_review":false},"categories":[3],"tags":[],"wppr_data":{"cwp_meta_box_check":"No"},"_links":{"self":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/posts\/7130"}],"collection":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/comments?post=7130"}],"version-history":[{"count":1,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/posts\/7130\/revisions"}],"predecessor-version":[{"id":7132,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/posts\/7130\/revisions\/7132"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/media\/7131"}],"wp:attachment":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/media?parent=7130"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/categories?post=7130"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/tags?post=7130"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}