{"id":101,"date":"2020-01-16T05:03:06","date_gmt":"2020-01-16T05:03:06","guid":{"rendered":"https:\/\/www.masteresearch.com\/?page_id=101"},"modified":"2021-11-06T05:33:30","modified_gmt":"2021-11-06T05:33:30","slug":"disclaimer","status":"publish","type":"page","link":"https:\/\/www.masteresearch.com\/disclaimer\/","title":{"rendered":"Disclaimer"},"content":{"rendered":"<div class=\"bt_bb_wrapper\"><p><section id=\"bt_bb_section646f72125d65f\"  class=\"bt_bb_section bt_bb_top_spacing_large bt_bb_bottom_spacing_large bt_bb_color_scheme_1 bt_bb_layout_boxed_1200 bt_bb_vertical_align_top\" ><div class=\"bt_bb_port\"><div class=\"bt_bb_cell\"><div class=\"bt_bb_cell_inner\"><div class=\"bt_bb_row_wrapper\"><div  class=\"bt_bb_row\" ><div  class=\"bt_bb_column col-xl-3 bt_bb_align_left bt_bb_vertical_align_top bt_bb_padding_normal\"  data-width=\"3\" data-bt-override-class=\"{}\"><div class=\"bt_bb_column_content\"><div class=\"bt_bb_column_content_inner\"><\/div><\/div><\/div><div  class=\"bt_bb_column col-xl-6 bt_bb_align_center bt_bb_vertical_align_middle bt_bb_padding_normal bt_bb_animation_fade_in animate\"  data-width=\"6\" data-bt-override-class=\"{}\"><div class=\"bt_bb_column_content\"><div class=\"bt_bb_column_content_inner\"><div class=\"bt_bb_separator bt_bb_bottom_spacing_medium bt_bb_border_style_none bt_bb_border_color_none\"><\/div><header class=\"bt_bb_headline bt_bb_dash_none bt_bb_size_huge bt_bb_subheadline bt_bb_align_inherit\" data-bt-override-class=\"{&quot;bt_bb_size_&quot;:{&quot;current_class&quot;:&quot;bt_bb_size_huge&quot;,&quot;xl&quot;:&quot;huge&quot;},&quot;bt_bb_align_&quot;:{&quot;current_class&quot;:&quot;bt_bb_align_inherit&quot;,&quot;xl&quot;:&quot;inherit&quot;}}\"><h1 class=\"bt_bb_headline_tag\"><span class=\"bt_bb_headline_content\"><span>Disclaimer<\/span><\/span><\/h1><div class=\"bt_bb_headline_subheadline\">_<\/div><\/header><\/div><\/div><\/div><div  class=\"bt_bb_column col-xl-3 bt_bb_align_left bt_bb_vertical_align_top bt_bb_padding_normal\"  data-width=\"3\" data-bt-override-class=\"{}\"><div class=\"bt_bb_column_content\"><div class=\"bt_bb_column_content_inner\"><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/section><section id=\"bt_bb_section646f72125da54\"  class=\"bt_bb_section bt_bb_color_scheme_2 bt_bb_layout_boxed_1200 bt_bb_vertical_align_top\" ><div class=\"bt_bb_port\"><div class=\"bt_bb_cell\"><div class=\"bt_bb_cell_inner\"><div class=\"bt_bb_row_wrapper\"><div  class=\"bt_bb_row\" ><div  class=\"bt_bb_column col-xl-12 col-xs-12 col-sm-12 col-md-12 col-lg-12 bt_bb_align_left bt_bb_vertical_align_top bt_bb_padding_normal\"  data-width=\"12\" data-bt-override-class=\"{}\"><div class=\"bt_bb_column_content\"><div class=\"bt_bb_column_content_inner\"><div class=\"bt_bb_separator bt_bb_bottom_spacing_50 bt_bb_border_style_none bt_bb_border_color_none\"><\/div><div  class=\"bt_bb_text\" ><\/p>\n<p>Terms of Use<\/p>\n<\/p>\n<p>You agree and understand that the information and material contained in this website implies and constitutes your consent to the terms and conditions mentioned below. You also agree that MASTERESEARCH.COM can modify or alter the terms and conditions of the use of this service without any liability.<\/p>\n<\/p>\n<p>The content of the site and the interpretation of data are solely the personal views of the contributors. MASTERESEARCH.COM reserves the right to make modifications and alterations to the content of the website. Users are advised to use the data for the purpose of information only and rely on their own judgment while making investment decisions. The investments discussed or recommended may not be suitable for all investors. MASTERESEARCH.COM does not warranty the timeliness, accuracy or quality of the electronic content.<\/p>\n<\/p>\n<p>A possibility exists that the site could include inaccuracies or errors. Additionally, a possibility exist that unauthorized additions, deletions or alterations could be made by third parties to the site. Although MASTERESEARCH.COM attempts to ensure the integrity, correctness and authenticity of the site, it makes no guarantees whatsoever as to its completeness, correctness or accuracy. In the event that such an inaccuracy arises, please inform MASTERESEARCH.COM so that it can be corrected.<\/p>\n<\/p>\n<p>The price and value of investments and the income derived from them can go down as well as up, and you may not get back the amount you invest. Changes in the rate of exchange may have an adverse effect on the value, price and income of investments in deposits other than your own. Past performance is not necessarily a guide to future performance. The services and investments referred to in our Site may have tax consequences and it is important to bear in mind that MASTERESEARCH.COM does not provide tax advice. The level of taxation depends on individual circumstances and such levels and bases of taxation can change. You should consult your own tax advisor in order to understand any applicable tax consequences.<\/p>\n<\/p>\n<p>MASTERESEARCH.COM does not make any personal recommendations. The information on our Internet site is provided solely to enable investors to make their own investment decisions and does not constitute a recommendation to buy, sell or otherwise deal in investments. Our services and the securities we offer services on may not be suitable for all customers.<\/p>\n<\/p>\n<p>The content of the website cannot be copied, reproduced, republished, uploaded, posted, transmitted or distributed for any non-personal use without obtaining prior permission from MASTERESEARCH.COM We reserve the right to terminate the accounts of subscribers\/ customers, who violate the proprietary rights, in addition to necessary legal action.<\/p>\n<\/p>\n<p>MASTERESEARCH.COM and its owners\/affiliates are not liable for damages caused by any performance, failure of performance, error, omission, interruption, deletion, defect, delay in transmission or operations, computer virus, communications line failure, and unauthorized access to the personal accounts. MASTERESEARCH.COM. is not responsible for any technical failure or malfunctioning of the software or delays of any kind. We are also not responsible for non-receipt of registration details or e-mails. Users shall bear all responsibility of keeping the password secure. MASTERESEARCH.COM is not responsible for the loss or misuse of the password.<\/p>\n<\/p>\n<p>MASTERESEARCH.COM. is not responsible for the content of any of the linked sites. By providing access to other web-sites, MASTERESEARCH.COM. Is neither recommending nor endorsing the content available in the linked websites.<\/p>\n<\/p>\n<p>You agree that the information gathered from your profile will be used to enhance your experience on the website. We will not rent or sell the profile to any third party. In case of a contest or a promotion scheme, we reserve the right to share the users profile with the sponsors. In the event of necessary credit checks and collection of payments, MASTERESEARCH.COM. Can disclose such information to other authorities in good faith. MASTERESEARCH.COM. will use all or any part of the service and change terms without any obligation.<\/p>\n<\/p>\n<p>This website is for the exclusive purpose of transactions to be carried out within the territorial jurisdiction of India and all such transactions shall be governed by the laws in India. Notice is hereby given that Non Resident Indians (NRI’s) and Foreign Nationals accessing this web site and opting to transact thereon shall do so after due verification at their end of their eligibility to do so. MASTERESEARCH.COM. undertakes no responsibility for such pre-eligibility of qualification on part of Non-Resident Indians (NRI’s) or Foreign Nationals to transact on this website.<\/p>\n<\/p>\n<p>You understand and agree that no joint venture, partnership, employment or agency relationship exists between you and us as a result of this agreement or on account of use of our web site.<\/p>\n<\/p>\n<p>Price and availability of products and services offered on the site are subject to change without prior notice. To the extent we provide information on the availability of products or services you should not rely on such information. MASTERESEARCH.COM will not be liable for any lack of availability of products and services you may order through the site.<\/p>\n<\/p>\n<p>Governing Law<\/p>\n<\/p>\n<p>Transactions between you and MASTERESEARCH.COM. Shall be governed by and construed in accordance with the laws of India, without regard to the laws regarding conflicts of law. Any litigation regarding this agreement or any transaction between customer and MASTERESEARCH.COM or any action at law or in equity arising out of or relating to these agreement or transaction shall be filed only in the Competent Courts of Haryana &amp; Delhi (India) and the customer hereby agrees, consents and submits to the jurisdiction of such courts for the purpose of litigating any such action.<\/p>\n<\/p>\n<p>Trade In Call and Put Option<\/p>\n<\/p>\n<p>TIPS VIA SMS:<\/p>\n<\/p>\n<p>TIPS VIA SMS is a service given only to members with the sole intention to aid their information means. www.MASTERESEARCH.COM does not guarantee any accuracy of generation, databases, delivery timings etc. while giving this facility. Depending on your location, service provider, medium of communication and delivery, the service may be at times slow or not there at all. www.MASTERESEARCH.COM does not guarantee completion of delivery.<\/p>\n<\/p>\n<p>www.MASTERESEARCH.COM shall in no way be responsible for delays in receiving SMS on the mobile caused due to delivery methods chosen by the Service Provider, rush on the Service Provider’s Servers or any other reason whatsoever that may cause such a delay.<\/p>\n<\/p>\n<p>Use of this website and its services constitutes acceptance of Disclaimer.<\/p>\n<\/p>\n<p>Any claim for the credit card payment after 15 days of payment will not be accepted. And same condition for the payment made by cheque,online transfer and cash.<\/p>\n<\/p>\n<p>Note–subscription charges once paid by you are not refundable.<\/p>\n<\/p>\n<p>Declaration–All Products and services are delivered 100% online by SMS Support : Online and email only.<\/p>\n<\/p>\n<p>CHARTS ARE FOR EDUCATIONAL PURPOSE NOT FOR COMMERCIAL AND TRADING PURPOSE. WE TRY TO MAINTAIN REALTIME DATA BUT SOME TIMES DATA MAY BE DELAYED ALSO DUE TO VARIOUS REASONS.<\/p>\n<\/p>\n<p>QUOTES ARE FOR EDUCATIONAL PURPOSE ONLY NOT FOR COMMERCIAL AND TRADING PURPOSE. WE TRY TO MAINTAIN REALTIME DATA BUT SOME TIMES DATA MAY BE DELAYED DUE TO VARIOUS REASONS.WE ARE NOT RESPONSIBLE FOR ANY KIND OF DELAYED QUOTES AND DIFFERENCE IN PRICE DUE TO IT.<\/p>\n<p>\n<\/div><div class=\"bt_bb_separator bt_bb_bottom_spacing_50 bt_bb_border_style_none bt_bb_border_color_none\"><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/div><\/section><\/p><\/div>","protected":false},"excerpt":{"rendered":"","protected":false},"author":1,"featured_media":0,"parent":0,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":{"_mi_skip_tracking":false,"_themeisle_gutenberg_block_has_review":false},"wppr_data":{"cwp_meta_box_check":"No"},"_links":{"self":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/pages\/101"}],"collection":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/comments?post=101"}],"version-history":[{"count":3,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/pages\/101\/revisions"}],"predecessor-version":[{"id":4106,"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/pages\/101\/revisions\/4106"}],"wp:attachment":[{"href":"https:\/\/www.masteresearch.com\/wp-json\/wp\/v2\/media?parent=101"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}